// =============================================
// UI RESOLUTION
// =============================================

// Весь интерфейс всегда рассчитываем как 1600x900
display_set_gui_size(1600, 900);

// Большое окно для тестирования
window_set_size(1600, 900);
window_center();
/// obj_game - Create Event

// ---------------------------------
// Materials
// ---------------------------------

global.materials = create_materials();


// ---------------------------------
// Recipes
// ---------------------------------

global.recipes = create_recipes();


// ---------------------------------
// Item Book
// ---------------------------------

global.discovered_items = [];
// =====================================================
// CRAFTED ITEM INVENTORY
// =====================================================

global.item_inventory = {};

// ---------------------------------
// Selected recipe
// ---------------------------------

global.selected_recipe = 0;


// ---------------------------------
// Craft result
// ---------------------------------

global.craft_result = "Press CRAFT to create an item.";

// =============================================
// MATERIAL POOLS
// =============================================

// Тестовый стартовый запас ресурсов

global.material_pool = {
    stone:      1000,
    polyester:  800,
    tree:       600,
    cloth:      500,
    glass:      450,
    jewels:     300,
    mushrooms:  150,
    blood:      100
};

// =============================================
// CRAFT LOG
// =============================================

global.craft_log = [];
global.craft_attempts = 0;

// =============================================
// ECONOMY
// =============================================

global.credits = 1000;
// =====================================================
// UI TABS
// =====================================================


// 0 = CRAFTING
// 1 = MARKET
// 2 = RESOURCES